1. select Название,ФИО from сотрудники inner join отделы on сотрудники.Отдел=отделы.Отдел
2. от 0 до min(m,n)
3. товары(название(pk), цена,...), заказы(номер(pk), клиент, сотрдуник, филиал), клиенты(номер телефона(pk)), филиалы(номер(pk),адрес), сотрудник(номер)
связи:
клиенты 1 - M заказы 
филиал 1 - M заказы
товары M - М заказы
сотрдуник 1 - M заказы
таблицы:
товары(название(pk), цена,...)
заказы(номер(pk), клиент(fk клиенты), сотрдуник(fk cотрудники), филиал(филиалы),...)
клиенты(номер телефона(pk),дата рождения,...)
филиалы(номер(pk),адрес,..)
сотрудники(номер(pk),...)
товары-заказ(название товаара(fk товары),номер заказа(fk заказы),..) pk:название товаара,номер заказа
условные обозначения:
pk - primary key
fk - forigen key
